Config/DataProcessors/ВыгрузкаФормы14Минфин.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаФормы14Минфин</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Config/InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтрокиОтчетов</v8:Type>
						<v8:Type>cfg:CatalogRef.Субконто</v8:Type>
						<v8:Type>cfg:CatalogRef.КолонкиОтчетов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ЗначенияПоказателейОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПоказателейОтчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеЧисло</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеНеограниченнаяСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаписьАктивна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПромежуточныйИтог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭкземплярОтчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УниверсальныйРегламентированныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/АналитикаПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АналитикаПоказателей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АналитикаОтчетов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаписьАктивна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭкземплярОтчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УниверсальныйРегламентированныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаРаскрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыРаскрытия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАналитики</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ПорядкиОкругленияОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПорядкиОкругленияОтчетности</Name>
			<Comment>Порядки округления отчетности</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Окр1</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр1000</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр1000000</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/УниверсальныйРегламентированныйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УниверсальныйРегламентированныйОтчет</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Периоды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньТочности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийРедактировавший</Name>
					<Comment>Пользователь, внесший последние изменения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоОбработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаПроверки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редакция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РедакцииОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БланкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеАналитики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПечатныйБланк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизвольныеБланкиФорм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатЗаполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Catalogs/ПоказателиОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПоказателиОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидИтога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИтоговПоказателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРаскрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыРаскрытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтрокиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Колонка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КолонкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеФинансовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбработкиПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗначенийПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеМасштабируется</Name>
					<Comment>Точность отображения показателя не зависит от точности отображения документа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеограниченнаяДлина</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПромежуточныеИтоги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньТочностиПоказателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндивидуальнаяТочность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/DataProcessors/ВыгрузкаФормы14Минфин/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>.
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Заполнение информации обработки.
// Интерфейс

Функция ПолучитьВерсиюAPI() Экспорт 
	
	Возврат "3.0";
	
КонецФункции

Функция ВерсияОбработки()
	Возврат "0.18.01.3";
КонецФункции

Процедура ЗаполнитьИнформациюОбработки(ДанныеОбработки) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеОбработки.Версия = ВерсияОбработки();
	ДанныеОбработки.Вставить("ИДФормата", "МФ_14");
	ДанныеОбработки.Вставить("ПолучательОтчетности", "Минфин РФ");
	
	ДанныеОбработки.НаименованиеПоУмолчанию = НСтр("ru = 'Выгрузка формы 14 Минфин'");
	ДанныеОбработки.ИнформацияОбОбработке = НСтр("ru = 'Выгрузка в Министерство финансов РФ квартальных отчетных данных о расходах и численности работников (код формы - 14, 14МО, 14РЕГ, 14ГРБС)
												|в формате:""2018.01"".'");
	
	ДанныеОбработки.СпособыОтправки.Добавить("Каталог");
	ДанныеОбработки.СпособыОтправки.Добавить("FTP");
	ДанныеОбработки.СпособыОтправки.Добавить("ЭлектроннаяПочта");
	
	ДанныеОбработки.ВидыОтчетов.Добавить("К0503074_2017");
	ДанныеОбработки.ВидыОтчетов.Добавить("К0503074_2025");
	ДанныеОбработки.ВидыОтчетов.Добавить("К0503075_2016");

	
	НоваяДопНастройка = ДанныеОбработки.ДополнительныеНастройки.Добавить();
	НоваяДопНастройка.Имя = "УровеньИсточника";
	НоваяДопНастройка.Заголовок = НСтр("ru = 'Вид источника для 0503074'");
	НоваяДопНастройка.ТипЗначения =  Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(1));
	НоваяДопНастройка.СписокВыбора.Добавить("3",НСтр("ru = '3 (форма 14ГРБС)'"));
	НоваяДопНастройка.СписокВыбора.Добавить("4",НСтр("ru = '4 (форма 14)'"));
	НоваяДопНастройка.СписокВыбора.Добавить("5",НСтр("ru = '5 (форма 14РЕГ)'"));
	НоваяДопНастройка.ЗапоминатьЗначение = Истина;
	НоваяДопНастройка.ПроверкаЗаполнения = Истина;
	
	  
КонецПроцедуры

// Интерфейс
// Заполнение информации обработки.
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Заполнение таблицы зависимостей.
// Интерфейс

Процедура ЗаполнитьТаблицуЗависимостей(МассивОтчетов, ТаблицаЗависимостей, ДополнительныеНастройкиФормата) Экспорт
	
КонецПроцедуры	

// Интерфейс
// Заполнение таблицы зависимостей.
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// формирование файлов отчетов.
// Интерфейс

Процедура СформироватьФайлыОтчетов(ТаблицаДанных, ТаблицаЗависимостей, ДополнительныеНастройкиФормата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураДанных = СформироватьСтруктуруДанныхФормированияФайлов();
	
	СтруктураДанных.ИсходныеДанные.ТаблицаДанных 		= ТаблицаДанных;
	СтруктураДанных.ИсходныеДанные.ТаблицаЗависимостей 	= ТаблицаЗависимостей;
	СтруктураДанных.ИсходныеДанные.ПараметрыВыгрузки 	= ДополнительныеНастройкиФормата;

	ИнициализацияФормированияФайлов(СтруктураДанных);
	
	Для Каждого СтрокаТаблицыДанных Из ТаблицаДанных Цикл 
		
		СтрокаТаблицыДанных.УИДОбработкиФормата = СтруктураДанных.ДО.УИДОбработкиФормата;
		
		СтруктураДанных.ДанныеТекущегоПакета = СтрокаТаблицыДанных; 
		ИнициализацияПакета(СтруктураДанных);
		
		
		СобратьДанные(СтруктураДанных);
		СформироватьВыходныеФайлы(СтруктураДанных);
		
		Попытка
			УдалитьФайлы(СтруктураДанных.ВременныйКаталог,"*"); // Удаление всех временных файлов.
		Исключение
		КонецПопытки;
		
	КонецЦикла;	
	
	Попытка
		УдалитьФайлы(СтруктураДанных.ВременныйКаталог); // Удаление самого временного каталога.
	Исключение
	КонецПопытки
	
КонецПроцедуры	

// Интерфейс
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Служебные
// Подготовка

Функция СформироватьСтруктуруДанныхФормированияФайлов()
	
	СтруктураДанных = Новый Структура;
	
	СтруктураДанных.Вставить("ДО",Новый Структура);  // ДанныеОбработки
	СтруктураДанных.ДО.Вставить("УИДОбработкиФормата");
	
	СтруктураДанных.Вставить("ИсходныеДанные",Новый Структура);
	СтруктураДанных.ИсходныеДанные.Вставить("ТаблицаДанных");
	СтруктураДанных.ИсходныеДанные.Вставить("ТаблицаЗависимостей");
	СтруктураДанных.ИсходныеДанные.Вставить("ПараметрыВыгрузки");
	
	СтруктураДанных.Вставить("Параметры", Новый Структура); // Состав описан в ПрочитатьДанныеИзНастроекФормата.
	
	СтруктураДанных.Вставить("ВременныйКаталог");
	СтруктураДанных.Вставить("ДанныеТекущегоПакета");
	СтруктураДанных.Вставить("НомерВерсииТекущегоПакета");
	
	СтруктураДанных.Вставить("ДанныеОтчетов",Новый ТаблицаЗначений);
	СтруктураДанных.ДанныеОтчетов.Колонки.Добавить("Организация");
	СтруктураДанных.ДанныеОтчетов.Колонки.Добавить("ПериодОтчета");
	СтруктураДанных.ДанныеОтчетов.Колонки.Добавить("КОДФ" 	,Новый ОписаниеТипов("Строка"));
	СтруктураДанных.ДанныеОтчетов.Колонки.Добавить("РДТ"	,Новый ОписаниеТипов("Дата"));
	СтруктураДанных.ДанныеОтчетов.Колонки.Добавить("ВИД" 	,Новый ОписаниеТипов("Строка"));
	СтруктураДанных.ДанныеОтчетов.Колонки.Добавить("ИСТ"	,Новый ОписаниеТипов("Строка"));
	СтруктураДанных.ДанныеОтчетов.Колонки.Добавить("УТВЧ"	,Новый ОписаниеТипов("Число"));
	СтруктураДанных.ДанныеОтчетов.Колонки.Добавить("Телефон",Новый ОписаниеТипов("Строка"));
	СтруктураДанных.ДанныеОтчетов.Колонки.Добавить("Отчеты" ,Новый ОписаниеТипов("Массив"));
	СтруктураДанных.ДанныеОтчетов.Колонки.Добавить("Секции" ,Новый ОписаниеТипов("ТаблицаЗначений"));
	
	СтруктураДанных.Вставить("ШаблонСекции",Новый ТаблицаЗначений);
	СтруктураДанных.ШаблонСекции.Колонки.Добавить("РЗПР",Новый ОписаниеТипов("Строка"));
	СтруктураДанных.ШаблонСекции.Колонки.Добавить("ЦСТ",Новый ОписаниеТипов("Строка"));
	СтруктураДанных.ШаблонСекции.Колонки.Добавить("ВР",Новый ОписаниеТипов("Строка"));
	СтруктураДанных.ШаблонСекции.Колонки.Добавить("КСТР",Новый ОписаниеТипов("Строка"));
	СтруктураДанных.ШаблонСекции.Колонки.Добавить("РЕГ",Новый ОписаниеТипов("Строка"));
	СтруктураДанных.ШаблонСекции.Колонки.Добавить("Раздел1",Новый ОписаниеТипов("ТаблицаЗначений"));
	СтруктураДанных.ШаблонСекции.Колонки.Добавить("Раздел2",Новый ОписаниеТипов("ТаблицаЗначений"));
	СтруктураДанных.ШаблонСекции.Колонки.Добавить("Раздел3",Новый ОписаниеТипов("ТаблицаЗначений"));
	СтруктураДанных.ШаблонСекции.Колонки.Добавить("Раздел4",Новый ОписаниеТипов("ТаблицаЗначений"));
	СтруктураДанных.ШаблонСекции.Колонки.Добавить("Раздел5",Новый ОписаниеТипов("ТаблицаЗначений"));
	СтруктураДанных.ШаблонСекции.Колонки.Добавить("Раздел6",Новый ОписаниеТипов("ТаблицаЗначений"));
	СтруктураДанных.ШаблонСекции.Колонки.Добавить("Раздел7",Новый ОписаниеТипов("ТаблицаЗначений"));
	СтруктураДанных.ШаблонСекции.Колонки.Добавить("Раздел8",Новый ОписаниеТипов("ТаблицаЗначений"));

	СтруктураДанных.Вставить("ШаблоныРазделов",Новый Структура);
	
	ТаблицаРаздела = Новый ТаблицаЗначений;
	ТаблицаРаздела.Колонки.Добавить("КодСтроки",БюджетнаяОтчетность.ПолучитьОписаниеТиповСтроки(3));
	ТаблицаРаздела.Колонки.Добавить("Графа03",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа04",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	СтруктураДанных.ШаблоныРазделов.Вставить("Раздел1",ТаблицаРаздела);

	
	ТаблицаРаздела = Новый ТаблицаЗначений;
	ТаблицаРаздела.Колонки.Добавить("КодСтроки",БюджетнаяОтчетность.ПолучитьОписаниеТиповСтроки(3));
	ТаблицаРаздела.Колонки.Добавить("Графа03",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа04",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа05",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	СтруктураДанных.ШаблоныРазделов.Вставить("Раздел2",ТаблицаРаздела);
	
	ТаблицаРаздела = Новый ТаблицаЗначений;
	ТаблицаРаздела.Колонки.Добавить("КодСтроки",БюджетнаяОтчетность.ПолучитьОписаниеТиповСтроки(3));
	ТаблицаРаздела.Колонки.Добавить("Графа03",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	СтруктураДанных.ШаблоныРазделов.Вставить("Раздел3",ТаблицаРаздела);
	
	ТаблицаРаздела = Новый ТаблицаЗначений;
	ТаблицаРаздела.Колонки.Добавить("КодСтроки",БюджетнаяОтчетность.ПолучитьОписаниеТиповСтроки(3));
	ТаблицаРаздела.Колонки.Добавить("Графа03",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	СтруктураДанных.ШаблоныРазделов.Вставить("Раздел4",ТаблицаРаздела);
	
	ТаблицаРаздела = Новый ТаблицаЗначений;
	ТаблицаРаздела.Колонки.Добавить("КодСтроки",БюджетнаяОтчетность.ПолучитьОписаниеТиповСтроки(3));
	ТаблицаРаздела.Колонки.Добавить("Графа03",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа04",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	СтруктураДанных.ШаблоныРазделов.Вставить("Раздел5",ТаблицаРаздела);
	
	ТаблицаРаздела = Новый ТаблицаЗначений;
	ТаблицаРаздела.Колонки.Добавить("КодСтроки",БюджетнаяОтчетность.ПолучитьОписаниеТиповСтроки(3));
	ТаблицаРаздела.Колонки.Добавить("Графа03",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа04",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	СтруктураДанных.ШаблоныРазделов.Вставить("Раздел6",ТаблицаРаздела);
	
	ТаблицаРаздела = Новый ТаблицаЗначений;
	ТаблицаРаздела.Колонки.Добавить("КодСтроки",БюджетнаяОтчетность.ПолучитьОписаниеТиповСтроки(3));
	ТаблицаРаздела.Колонки.Добавить("Графа03",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа04",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа05",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа06",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа07",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа08",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа09",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа10",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа11",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа12",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа13",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа14",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа15",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа16",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа17",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа18",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа19",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа20",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа21",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа22",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа23",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	СтруктураДанных.ШаблоныРазделов.Вставить("Раздел7",ТаблицаРаздела);
	
	ТаблицаРаздела = Новый ТаблицаЗначений;
	ТаблицаРаздела.Колонки.Добавить("Графа02",БюджетнаяОтчетность.ПолучитьОписаниеТиповСтроки(150));
	ТаблицаРаздела.Колонки.Добавить("КодСтроки",БюджетнаяОтчетность.ПолучитьОписаниеТиповСтроки(3));
	ТаблицаРаздела.Колонки.Добавить("Графа04",БюджетнаяОтчетность.ПолучитьОписаниеТиповСтроки(150));
	ТаблицаРаздела.Колонки.Добавить("Графа05",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа06",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа07",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа08",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа09",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	ТаблицаРаздела.Колонки.Добавить("Графа10",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(20,0));
	СтруктураДанных.ШаблоныРазделов.Вставить("Раздел8",ТаблицаРаздела);
	
	
	Возврат СтруктураДанных;
	
КонецФункции

Процедура ИнициализацияФормированияФайлов(СтруктураДанных)
	
	ЗаполнитьУИДОбработки(СтруктураДанных);
	ПодготовитьВременныйКаталог(СтруктураДанных);
	ПрочитатьДанныеИзНастроекФормата(СтруктураДанных);
	
КонецПроцедуры

Процедура ЗаполнитьУИДОбработки(СтруктураДанных)
	СтруктураДанных.ДО.УИДОбработкиФормата = "f3d5bb71-3910-45ef-ae5e-5a10cae1df79"; 
КонецПроцедуры

Процедура ПодготовитьВременныйКаталог(СтруктураДанных)
	
	СтруктураДанных.ВременныйКаталог  = ПолучитьИмяВременногоФайла()+ПолучитьРазделительПути();
	СоздатьКаталог(СтруктураДанных.ВременныйКаталог);
	
КонецПроцедуры	

Процедура ПрочитатьДанныеИзНастроекФормата(СтруктураДанных)
	
	ДопНастройка = СтруктураДанных.ИсходныеДанные.ПараметрыВыгрузки.Найти("УровеньИсточника","Имя");
	
	Если ДопНастройка = Неопределено Тогда 
		Значение = "3";
	Иначе 
		Значение = ДопНастройка.Значение;
	КонецЕсли;
	СтруктураДанных.Параметры.Вставить("УровеньИсточника", Значение);
	
КонецПроцедуры

Процедура ИнициализацияПакета(СтруктураДанных)
	СтруктураДанных.ДанныеОтчетов.Очистить();
	
	ПодготовитьНомерВерсий(СтруктураДанных);
	
КонецПроцедуры

Процедура ПодготовитьНомерВерсий(СтруктураДанных)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",СтруктураДанных.ДанныеТекущегоПакета.Организация);
	Запрос.УстановитьПараметр("Период",СтруктураДанных.ДанныеТекущегоПакета.Период);
	Запрос.УстановитьПараметр("УИДОбработкиФормата",СтруктураДанных.ДО.УИДОбработкиФормата);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КОЛИЧЕСТВО(ПакетВыгрузкиОтчетности.Ссылка) + 1 КАК НомерВерсии
	|ИЗ
	|	Документ.ПакетВыгрузкиОтчетности КАК ПакетВыгрузкиОтчетности
	|ГДЕ
	|	ПакетВыгрузкиОтчетности.Организация = &Организация
	|	И ПакетВыгрузкиОтчетности.Период = &Период
	|	И ПакетВыгрузкиОтчетности.ПометкаУдаления = ЛОЖЬ
	|	И ПакетВыгрузкиОтчетности.УИДОбработкиФормата = &УИДОбработкиФормата";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		СтруктураДанных.НомерВерсииТекущегоПакета = 1;
	Иначе 
		СтруктураДанных.НомерВерсииТекущегоПакета = Результат.Выгрузить()[0].НомерВерсии;
	КонецЕсли;
	
КонецПроцедуры

// Подготовка
////////////////////////////////////////////////////////////////////////////////
// Выгрузка
// Сбор данных

Процедура  СобратьДанные(СтруктураДанных)

	ВидАналитикиРаздел  = ПланыВидовХарактеристик.АналитикаОтчетов.НайтиПоКоду("КРБРаздел");
	ВидАналитикиЦС      = ПланыВидовХарактеристик.АналитикаОтчетов.НайтиПоКоду("КРБЦелеваяСтатья");
	ВидАналитикиПЦС     = ПланыВидовХарактеристик.АналитикаОтчетов.НайтиПоКоду("КРБПрограмма");
	ВидАналитикиВР      = ПланыВидовХарактеристик.АналитикаОтчетов.НайтиПоКоду("КРБВид");
	ВидАналитикиСубъект = ПланыВидовХарактеристик.АналитикаОтчетов.НайтиПоКоду("СУБЪЕКТ");
	ВидАналитикиКлючСтроки = ПланыВидовХарактеристик.АналитикаОтчетов.НайтиПоКоду("КСТР"); 
	
	Если ВидАналитикиРаздел.Пустая() Тогда
		ВызватьИсключение "Не обнаружен вид аналитики ""Раздел КРБ"". Выгрузка невозможна!";
	КонецЕсли;
	
	Если ВидАналитикиЦС.Пустая() Тогда
		ВызватьИсключение "Не обнаружен вид аналитики ""Целевая статья КРБ"". Выгрузка невозможна!";
	КонецЕсли;
	
	Если ВидАналитикиПЦС.Пустая() Тогда
		ВызватьИсключение "Не обнаружен вид аналитики ""Программа целевой статьи"". Выгрузка невозможна!";
	КонецЕсли;
		
	Если ВидАналитикиВР.Пустая() Тогда
		ВызватьИсключение "Не обнаружен вид аналитики ""Вид расходов"". Выгрузка невозможна!";
	КонецЕсли;
	
	Если ВидАналитикиСубъект.Пустая() Тогда
		ВызватьИсключение "Не обнаружен вид аналитики ""СУБЪЕКТ"". Выгрузка невозможна!";
	КонецЕсли;
	
	Если ВидАналитикиКлючСтроки.Пустая() Тогда
		ВызватьИсключение "Не обнаружен вид аналитики ""Ключ строки 14 форм"". Выгрузка невозможна!";
	КонецЕсли;


	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СписокДокументов"		,СтруктураДанных.ДанныеТекущегоПакета.Отчеты.ВыгрузитьКолонку("Отчет"));
	Запрос.УстановитьПараметр("КодУровня"				,СтруктураДанных.Параметры.УровеньИсточника);

	Запрос.УстановитьПараметр("ВидАналитикиРаздел"		,ВидАналитикиРаздел);
	Запрос.УстановитьПараметр("ВидАналитикиЦС"			,ВидАналитикиЦС);
	Запрос.УстановитьПараметр("ВидАналитикиПЦС"			,ВидАналитикиПЦС);
	Запрос.УстановитьПараметр("ВидАналитикиВР"			,ВидАналитикиВР);
	Запрос.УстановитьПараметр("ВидАналитикиСубъектРФ"	,ВидАналитикиСубъект);
	Запрос.УстановитьПараметр("ВидАналитикиКлючСтроки"	,ВидАналитикиКлючСтроки);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УниверсальныйРегламентированныйОтчет.Организация,
	|	УниверсальныйРегламентированныйОтчет.ПериодОтчета КАК ПериодОтчета,
	|	&КодУровня КАК КодУровня,
	|	ВЫБОР
	|		КОГДА &КодУровня = ""3""
	|			ТОГДА ""014grbs""
	|		КОГДА &КодУровня = ""4""
	|			ТОГДА ""014""
	|		КОГДА &КодУровня = ""5""
	|			ТОГДА ""014reg""
	|		ИНАЧЕ ""014""
	|	КОНЕЦ КАК ВидФормы,
	|	ВЫБОР
	|		КОГДА &КодУровня = ""3""
	|			ТОГДА УниверсальныйРегламентированныйОтчет.Организация.КодПоППП.Код
	|		КОГДА &КодУровня = ""4""
	|			ТОГДА УниверсальныйРегламентированныйОтчет.Организация.СубъектРФ.Код
	|		КОГДА &КодУровня = ""5""
	|			ТОГДА УниверсальныйРегламентированныйОтчет.Организация.КодПоППП.Код
	|		ИНАЧЕ УниверсальныйРегламентированныйОтчет.Организация.СубъектРФ.Код
	|	КОНЕЦ КАК Источник,
	|	УниверсальныйРегламентированныйОтчет.Ссылка
	|ПОМЕСТИТЬ ДанныеГруппировкиОтчетов
	|ИЗ
	|	Документ.УниверсальныйРегламентированныйОтчет КАК УниверсальныйРегламентированныйОтчет
	|ГДЕ
	|	УниверсальныйРегламентированныйОтчет.Ссылка В(&СписокДокументов)
	|	И УниверсальныйРегламентированныйОтчет.ВидОтчета.Код В (""К0503074_2017"",""К0503074_2025"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УниверсальныйРегламентированныйОтчет.Организация,
	|	УниверсальныйРегламентированныйОтчет.ПериодОтчета,
	|	""6"",
	|	""014mo"",
	|	УниверсальныйРегламентированныйОтчет.Организация.СубъектРФ.Код,
	|	УниверсальныйРегламентированныйОтчет.Ссылка
	|ИЗ
	|	Документ.УниверсальныйРегламентированныйОтчет КАК УниверсальныйРегламентированныйОтчет
	|ГДЕ
	|	УниверсальныйРегламентированныйОтчет.Ссылка В(&СписокДокументов)
	|	И УниверсальныйРегламентированныйОтчет.ВидОтчета.Код = ""К0503075_2016""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказателиОтчетов.Ссылка,
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектовРаздел.Значение КАК СТРОКА(20)) КАК Раздел,
	|	ПОДСТРОКА(ВЫРАЗИТЬ(ЗначенияСвойствОбъектовКодКолонки.Значение КАК СТРОКА(20)), 1, 3) КАК КодСтроки,
	|	ПОДСТРОКА(ВЫРАЗИТЬ(ЗначенияСвойствОбъектовКодКолонки.Значение КАК СТРОКА(20)), 4, 2) КАК КодГрафы,
	|	ПоказателиОтчетов.НеМасштабируется
	|ПОМЕСТИТЬ ПринадлежностьПоказателей
	|ИЗ
	|	Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектовРаздел
	|		ПО (ЗначенияСвойствОбъектовРаздел.Свойство.Код = ""Раздел"")
	|			И ПоказателиОтчетов.Колонка = ЗначенияСвойствОбъектовРаздел.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектовКодКолонки
	|		ПО (ЗначенияСвойствОбъектовКодКолонки.Свойство.Код = ""КодКолонкиФ1_10"")
	|			И ПоказателиОтчетов.Колонка = ЗначенияСвойствОбъектовКодКолонки.Объект
	|ГДЕ
	|	ПоказателиОтчетов.Владелец.Код В (""К0503074_2017"", ""К0503074_2025"", ""К0503075_2016"")
	|	И ЗначенияСвойствОбъектовРаздел.Значение В (""Раздел1"", ""Раздел2"", ""Раздел3"", ""Раздел4"", ""Раздел5"", ""Раздел6"")
	|	И ЕСТЬNULL(ЗначенияСвойствОбъектовКодКолонки.Значение, """") <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоказателиОтчетов.Ссылка,
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектовРаздел.Значение КАК СТРОКА(20)),
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектовКодСтроки.Значение КАК СТРОКА(20)),
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектовКодКолонки.Значение КАК СТРОКА(20)),
	|	ПоказателиОтчетов.НеМасштабируется
	|ИЗ
	|	Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектовРаздел
	|		ПО (ЗначенияСвойствОбъектовРаздел.Свойство.Код = ""Раздел"")
	|			И ПоказателиОтчетов.Колонка = ЗначенияСвойствОбъектовРаздел.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектовКодКолонки
	|		ПО (ЗначенияСвойствОбъектовКодКолонки.Свойство.Код = ""КодГрафы"")
	|			И ПоказателиОтчетов.Колонка = ЗначенияСвойствОбъектовКодКолонки.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектовКодСтроки
	|		ПО (ЗначенияСвойствОбъектовКодСтроки.Свойство.Код = ""КодСтроки"")
	|			И ПоказателиОтчетов.Строка = ЗначенияСвойствОбъектовКодСтроки.Объект
	|ГДЕ
	|	ПоказателиОтчетов.Владелец.Код В (""К0503074_2017"",""К0503074_2025"")
	|	И ЗначенияСвойствОбъектовРаздел.Значение В (""Раздел7"", ""Раздел8"")
	|	И ЕСТЬNULL(ЗначенияСвойствОбъектовКодКолонки.Значение, """") <> """"
	|	И ЕСТЬNULL(ЗначенияСвойствОбъектовКодСтроки.Значение, """") <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияПоказателейОтчетов.ЭкземплярОтчета,
	|	ПринадлежностьПоказателей.Раздел,
	|	ПринадлежностьПоказателей.КодСтроки,
	|	ПринадлежностьПоказателей.КодГрафы,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(АналитикаРаздел.Значение КАК Справочник.РазделыПодразделыКРБ).Код, ""0000"") КАК РЗПР,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(АналитикаЦС.Значение КАК Справочник.ЦелевыеСтатьиКРБ).Код, ""00000"") + ЕСТЬNULL(ВЫРАЗИТЬ(АналитикаПЦС.Значение КАК Справочник.ПрограммыЦелевыхСтатейКРБ).Код, ""00000"") КАК ЦСТ,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(АналитикаВР.Значение КАК Справочник.ВидыРасходовКРБ).Код, ""000"") КАК ВР,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(АналитикаСубъектРФ.Значение КАК Справочник.СубъектыРФ).Код, ""00"") КАК РЕГ,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(АналитикаКСТР.Значение КАК Справочник.Субконто).Код, ""-"") КАК КСТР,
	|	СУММА(ЗначенияПоказателейОтчетов.ЗначениеЧисло / ВЫБОР
	|			КОГДА ПринадлежностьПоказателей.НеМасштабируется
	|				ТОГДА 1
	|			КОГДА ЗначенияПоказателейОтчетов.ЭкземплярОтчета.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.Окр1)
	|				ТОГДА 1
	|			КОГДА ЗначенияПоказателейОтчетов.ЭкземплярОтчета.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.Окр1000)
	|				ТОГДА 1000
	|			КОГДА ЗначенияПоказателейОтчетов.ЭкземплярОтчета.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.Окр1000000)
	|				ТОГДА 1000000
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК Значение,
	|	"""" КАК ЗначениеСтрока,
	|	1 КАК ПорядокСекций
	|ПОМЕСТИТЬ ДанныеПоказателей
	|ИЗ
	|	РегистрСведений.ЗначенияПоказателейОтчетов КАК ЗначенияПоказателейОтчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеГруппировкиОтчетов КАК ДанныеГруппировкиОтчетов
	|		ПО ЗначенияПоказателейОтчетов.ЭкземплярОтчета = ДанныеГруппировкиОтчетов.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПринадлежностьПоказателей КАК ПринадлежностьПоказателей
	|		ПО ЗначенияПоказателейОтчетов.Показатель = ПринадлежностьПоказателей.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаПоказателей КАК АналитикаРаздел
	|		ПО ЗначенияПоказателейОтчетов.ЭкземплярОтчета = АналитикаРаздел.ЭкземплярОтчета
	|			И ЗначенияПоказателейОтчетов.Показатель.ГруппаРаскрытия = АналитикаРаздел.ГруппаРаскрытия
	|			И (АналитикаРаздел.ВидАналитики = &ВидАналитикиРаздел)
	|			И ЗначенияПоказателейОтчетов.Индекс = АналитикаРаздел.Индекс
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаПоказателей КАК АналитикаЦС
	|		ПО ЗначенияПоказателейОтчетов.ЭкземплярОтчета = АналитикаЦС.ЭкземплярОтчета
	|			И ЗначенияПоказателейОтчетов.Показатель.ГруппаРаскрытия = АналитикаЦС.ГруппаРаскрытия
	|			И (АналитикаЦС.ВидАналитики = &ВидАналитикиЦС)
	|			И ЗначенияПоказателейОтчетов.Индекс = АналитикаЦС.Индекс
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаПоказателей КАК АналитикаПЦС
	|		ПО ЗначенияПоказателейОтчетов.ЭкземплярОтчета = АналитикаПЦС.ЭкземплярОтчета
	|			И ЗначенияПоказателейОтчетов.Показатель.ГруппаРаскрытия = АналитикаПЦС.ГруппаРаскрытия
	|			И (АналитикаПЦС.ВидАналитики = &ВидАналитикиПЦС)
	|			И ЗначенияПоказателейОтчетов.Индекс = АналитикаПЦС.Индекс
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаПоказателей КАК АналитикаВР
	|		ПО ЗначенияПоказателейОтчетов.ЭкземплярОтчета = АналитикаВР.ЭкземплярОтчета
	|			И ЗначенияПоказателейОтчетов.Показатель.ГруппаРаскрытия = АналитикаВР.ГруппаРаскрытия
	|			И (АналитикаВР.ВидАналитики = &ВидАналитикиВР)
	|			И ЗначенияПоказателейОтчетов.Индекс = АналитикаВР.Индекс
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаПоказателей КАК АналитикаКСТР
	|		ПО ЗначенияПоказателейОтчетов.ЭкземплярОтчета = АналитикаКСТР.ЭкземплярОтчета
	|			И ЗначенияПоказателейОтчетов.Показатель.ГруппаРаскрытия = АналитикаКСТР.ГруппаРаскрытия
	|			И (АналитикаКСТР.ВидАналитики = &ВидАналитикиКлючСтроки)
	|			И ЗначенияПоказателейОтчетов.Индекс = АналитикаКСТР.Индекс
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаПоказателей КАК АналитикаСубъектРФ
	|		ПО ЗначенияПоказателейОтчетов.ЭкземплярОтчета = АналитикаСубъектРФ.ЭкземплярОтчета
	|			И ЗначенияПоказателейОтчетов.Показатель.ГруппаРаскрытия = АналитикаСубъектРФ.ГруппаРаскрытия
	|			И (АналитикаСубъектРФ.ВидАналитики = &ВидАналитикиСубъектРФ)
	|			И ЗначенияПоказателейОтчетов.Индекс = АналитикаСубъектРФ.Индекс
	|			И (ДанныеГруппировкиОтчетов.КодУровня = ""5"")
	|ГДЕ
	|	ЗначенияПоказателейОтчетов.Индекс > 0
	|	И ПринадлежностьПоказателей.Раздел В (""Раздел1"", ""Раздел2"", ""Раздел3"", ""Раздел4"", ""Раздел5"", ""Раздел6"")
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗначенияПоказателейОтчетов.ЭкземплярОтчета,
	|	ПринадлежностьПоказателей.Раздел,
	|	ПринадлежностьПоказателей.КодСтроки,
	|	ПринадлежностьПоказателей.КодГрафы,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(АналитикаРаздел.Значение КАК Справочник.РазделыПодразделыКРБ).Код, ""0000""),
	|	ЕСТЬNULL(ВЫРАЗИТЬ(АналитикаЦС.Значение КАК Справочник.ЦелевыеСтатьиКРБ).Код, ""00000"") + ЕСТЬNULL(ВЫРАЗИТЬ(АналитикаПЦС.Значение КАК Справочник.ПрограммыЦелевыхСтатейКРБ).Код, ""00000""),
	|	ЕСТЬNULL(ВЫРАЗИТЬ(АналитикаВР.Значение КАК Справочник.ВидыРасходовКРБ).Код, ""000""),
	|	ЕСТЬNULL(ВЫРАЗИТЬ(АналитикаСубъектРФ.Значение КАК Справочник.СубъектыРФ).Код, ""00""),
	|	ЕСТЬNULL(ВЫРАЗИТЬ(АналитикаКСТР.Значение КАК Справочник.Субконто).Код, ""-"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗначенияПоказателейОтчетов.ЭкземплярОтчета,
	|	ПринадлежностьПоказателей.Раздел,
	|	ПринадлежностьПоказателей.КодСтроки,
	|	ПринадлежностьПоказателей.КодГрафы,
	|	""-"",
	|	""-"",
	|	""-"",
	|	""-"",
	|	""-"",
	|	СУММА(ЗначенияПоказателейОтчетов.ЗначениеЧисло / ВЫБОР
	|			КОГДА ПринадлежностьПоказателей.НеМасштабируется
	|				ТОГДА 1
	|			КОГДА ЗначенияПоказателейОтчетов.ЭкземплярОтчета.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.Окр1)
	|				ТОГДА 1
	|			КОГДА ЗначенияПоказателейОтчетов.ЭкземплярОтчета.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.Окр1000)
	|				ТОГДА 1000
	|			КОГДА ЗначенияПоказателейОтчетов.ЭкземплярОтчета.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.Окр1000000)
	|				ТОГДА 1000000
	|			ИНАЧЕ 1
	|		КОНЕЦ),
	|	"""",
	|	2
	|ИЗ
	|	РегистрСведений.ЗначенияПоказателейОтчетов КАК ЗначенияПоказателейОтчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеГруппировкиОтчетов КАК ДанныеГруппировкиОтчетов
	|		ПО ЗначенияПоказателейОтчетов.ЭкземплярОтчета = ДанныеГруппировкиОтчетов.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПринадлежностьПоказателей КАК ПринадлежностьПоказателей
	|		ПО ЗначенияПоказателейОтчетов.Показатель = ПринадлежностьПоказателей.Ссылка
	|ГДЕ
	|	ЗначенияПоказателейОтчетов.Индекс = 0
	|	И ПринадлежностьПоказателей.Раздел В (""Раздел7"")
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗначенияПоказателейОтчетов.ЭкземплярОтчета,
	|	ПринадлежностьПоказателей.Раздел,
	|	ПринадлежностьПоказателей.КодСтроки,
	|	ПринадлежностьПоказателей.КодГрафы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗначенияПоказателейОтчетов.ЭкземплярОтчета,
	|	ПринадлежностьПоказателей.Раздел,
	|	ЗначенияПоказателейОтчетов.Индекс,
	|	ПринадлежностьПоказателей.КодГрафы,
	|	""-"",
	|	""-"",
	|	""-"",
	|	""-"",
	|	""-"",
	|	СУММА(ЗначенияПоказателейОтчетов.ЗначениеЧисло / ВЫБОР
	|			КОГДА ПринадлежностьПоказателей.НеМасштабируется
	|				ТОГДА 1
	|			КОГДА ЗначенияПоказателейОтчетов.ЭкземплярОтчета.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.Окр1)
	|				ТОГДА 1
	|			КОГДА ЗначенияПоказателейОтчетов.ЭкземплярОтчета.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.Окр1000)
	|				ТОГДА 1000
	|			КОГДА ЗначенияПоказателейОтчетов.ЭкземплярОтчета.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.Окр1000000)
	|				ТОГДА 1000000
	|			ИНАЧЕ 1
	|		КОНЕЦ),
	|	МАКСИМУМ(ЗначенияПоказателейОтчетов.Значение),
	|	3
	|ИЗ
	|	РегистрСведений.ЗначенияПоказателейОтчетов КАК ЗначенияПоказателейОтчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеГруппировкиОтчетов КАК ДанныеГруппировкиОтчетов
	|		ПО ЗначенияПоказателейОтчетов.ЭкземплярОтчета = ДанныеГруппировкиОтчетов.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПринадлежностьПоказателей КАК ПринадлежностьПоказателей
	|		ПО ЗначенияПоказателейОтчетов.Показатель = ПринадлежностьПоказателей.Ссылка
	|ГДЕ
	|	ЗначенияПоказателейОтчетов.Индекс <> 0
	|	И ПринадлежностьПоказателей.Раздел В (""Раздел8"")
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗначенияПоказателейОтчетов.ЭкземплярОтчета,
	|	ПринадлежностьПоказателей.Раздел,
	|	ЗначенияПоказателейОтчетов.Индекс,
	|	ПринадлежностьПоказателей.КодГрафы";
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеГруппировкиОтчетов.Организация,
	|	ДанныеГруппировкиОтчетов.ПериодОтчета,
	|	ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ДанныеГруппировкиОтчетов.ПериодОтчета.ДатаОкончания, ДЕНЬ), СЕКУНДА, 1) КАК РДТ,
	|	ДанныеГруппировкиОтчетов.КодУровня КАК ВИД,
	|	ДанныеГруппировкиОтчетов.ВидФормы КАК КОДФ,
	|	ДанныеГруппировкиОтчетов.Источник КАК ИСТ,
	|	ДанныеГруппировкиОтчетов.Ссылка,
	|	ЕСТЬNULL(ДанныеоПредельнойЧисленности.ЗначениеЧисло, 0) КАК УТВЧ,
	|	ЕСТЬNULL(ТелефоныИсполнителей.Значение, """") КАК Телефон
	|ИЗ
	|	ДанныеГруппировкиОтчетов КАК ДанныеГруппировкиОтчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗначенияПоказателейОтчетов.ЭкземплярОтчета КАК ЭкземплярОтчета,
	|			СУММА(ЗначенияПоказателейОтчетов.ЗначениеЧисло) КАК ЗначениеЧисло
	|		ИЗ
	|			РегистрСведений.ЗначенияПоказателейОтчетов КАК ЗначенияПоказателейОтчетов
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеГруппировкиОтчетов КАК ДанныеГруппировкиОтчетов
	|				ПО ЗначенияПоказателейОтчетов.ЭкземплярОтчета = ДанныеГруппировкиОтчетов.Ссылка
	|		ГДЕ
	|			ЗначенияПоказателейОтчетов.Показатель.Код = ""Шапка_ПределЧисленности""
	|			И ДанныеГруппировкиОтчетов.КодУровня В (""3"", ""5"")
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗначенияПоказателейОтчетов.ЭкземплярОтчета) КАК ДанныеоПредельнойЧисленности
	|		ПО ДанныеГруппировкиОтчетов.Ссылка = ДанныеоПредельнойЧисленности.ЭкземплярОтчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ДанныеГруппировкиОтчетов.Ссылка КАК Ссылка,
	|			МАКСИМУМ(УниверсальныйРегламентированныйОтчетПараметрыОтчета.Значение) КАК Значение
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ДанныеГруппировкиОтчетов.Организация КАК Организация,
	|				ДанныеГруппировкиОтчетов.ПериодОтчета КАК ПериодОтчета,
	|				ДанныеГруппировкиОтчетов.КодУровня КАК КодУровня,
	|				ДанныеГруппировкиОтчетов.ВидФормы КАК ВидФормы,
	|				ДанныеГруппировкиОтчетов.Источник КАК Источник
	|			ИЗ
	|				ДанныеГруппировкиОтчетов КАК ДанныеГруппировкиОтчетов
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ДанныеГруппировкиОтчетов.Организация,
	|				ДанныеГруппировкиОтчетов.ПериодОтчета,
	|				ДанныеГруппировкиОтчетов.КодУровня,
	|				ДанныеГруппировкиОтчетов.ВидФормы,
	|				ДанныеГруппировкиОтчетов.Источник
	|			
	|			ИМЕЮЩИЕ
	|				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеГруппировкиОтчетов.Ссылка) = 1) КАК ГруппировкиСОднимОтчетом
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеГруппировкиОтчетов КАК ДанныеГруппировкиОтчетов
	|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.УниверсальныйРегламентированныйОтчет.ПараметрыОтчета КАК УниверсальныйРегламентированныйОтчетПараметрыОтчета
	|					ПО ДанныеГруппировкиОтчетов.Ссылка = УниверсальныйРегламентированныйОтчетПараметрыОтчета.Ссылка
	|						И (УниверсальныйРегламентированныйОтчетПараметрыОтчета.Код = ""ИсполнительТелефон"")
	|				ПО ГруппировкиСОднимОтчетом.Организация = ДанныеГруппировкиОтчетов.Организация
	|					И ГруппировкиСОднимОтчетом.ПериодОтчета = ДанныеГруппировкиОтчетов.ПериодОтчета
	|					И ГруппировкиСОднимОтчетом.КодУровня = ДанныеГруппировкиОтчетов.КодУровня
	|					И ГруппировкиСОднимОтчетом.ВидФормы = ДанныеГруппировкиОтчетов.ВидФормы
	|					И ГруппировкиСОднимОтчетом.Источник = ДанныеГруппировкиОтчетов.Источник
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДанныеГруппировкиОтчетов.Ссылка) КАК ТелефоныИсполнителей
	|		ПО ДанныеГруппировкиОтчетов.Ссылка = ТелефоныИсполнителей.Ссылка";
	ДанныеГруппуировкиВФайлы = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеПоказателей.РЗПР КАК РЗПР,
	|	ДанныеПоказателей.ЦСТ КАК ЦСТ,
	|	ДанныеПоказателей.ВР КАК ВР,
	|	ДанныеПоказателей.РЕГ КАК РЕГ,
	|	ДанныеПоказателей.ПорядокСекций КАК ПорядокСекций,
	|	ДанныеПоказателей.КСТР КАК КСТР
	|ИЗ
	|	ДанныеПоказателей КАК ДанныеПоказателей
	|ГДЕ
	|	(ДанныеПоказателей.РЗПР <> """"
	|			ИЛИ ДанныеПоказателей.ЦСТ <> """"
	|			ИЛИ ДанныеПоказателей.ВР <> """"
	|			ИЛИ ДанныеПоказателей.РЕГ <> """"
	|			ИЛИ ДанныеПоказателей.КСТР <> """")
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокСекций,
	|	РЗПР,
	|	ЦСТ,
	|	ВР,
	|	РЕГ,
	|	КСТР";
	ФормируемыеСекции = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеПоказателей.ЭкземплярОтчета КАК ЭкземплярОтчета,
	|	ДанныеПоказателей.Раздел КАК Раздел,
	|	ДанныеПоказателей.КодСтроки КАК КодСтроки,
	|	ДанныеПоказателей.КодГрафы КАК КодГрафы,
	|	ДанныеПоказателей.РЗПР,
	|	ДанныеПоказателей.ЦСТ,
	|	ДанныеПоказателей.ВР,
	|	ДанныеПоказателей.РЕГ,
	|	ДанныеПоказателей.Значение,
	|	ДанныеПоказателей.ЗначениеСтрока,
	|	ДанныеПоказателей.КСТР
	|ИЗ
	|	ДанныеПоказателей КАК ДанныеПоказателей
	|ГДЕ
	|	ДанныеПоказателей.Значение <> 0 ИЛИ ДанныеПоказателей.ЗначениеСтрока <> """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭкземплярОтчета,
	|	Раздел,
	|	КодСтроки,
	|	КодГрафы";
	ДанныеПоказателей = Запрос.Выполнить().Выгрузить();
	
	
	Для Каждого ДанныеВыгружаемогоОтчета из ДанныеГруппуировкиВФайлы Цикл 
		
		СтруктураПоиска = Новый Структура("Организация,ПериодОтчета,РДТ,ВИД,КОДФ,ИСТ");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска,ДанныеВыгружаемогоОтчета);
		
		НайденыеСтроки = СтруктураДанных.ДанныеОтчетов.НайтиСтроки(СтруктураПоиска);
		Если ЗначениеЗаполнено(НайденыеСтроки) Тогда
			СтрокаФайлаОтчета = НайденыеСтроки[0];
			
		Иначе 
			СтрокаФайлаОтчета = СтруктураДанных.ДанныеОтчетов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаФайлаОтчета,СтруктураПоиска);
			СтрокаФайлаОтчета.УТВЧ = ДанныеВыгружаемогоОтчета.УТВЧ;
			СтрокаФайлаОтчета.Телефон = ДанныеВыгружаемогоОтчета.Телефон;
			
			СтрокаФайлаОтчета.Секции = СтруктураДанных.ШаблонСекции.СкопироватьКолонки();
			
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаФайлаОтчета.Отчеты,ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеВыгружаемогоОтчета.Ссылка),Истина);
		
		ДанныеСтрокОтчета = ДанныеПоказателей.Скопировать(Новый Структура("ЭкземплярОтчета",ДанныеВыгружаемогоОтчета.Ссылка));
		
		Для Каждого ФормируемаяСекция из ФормируемыеСекции Цикл 
			
			СтруктураПоиска = Новый Структура("РЗПР,ЦСТ,ВР,КСТР");
			Если ДанныеВыгружаемогоОтчета.ВИД = "5" Тогда
				СтруктураПоиска.Вставить("РЕГ");
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтруктураПоиска,ФормируемаяСекция);
			
			ДанныеСекции = ДанныеСтрокОтчета.НайтиСтроки(СтруктураПоиска);
			Если Не ЗначениеЗаполнено(ДанныеСекции) Тогда 
				Продолжить;
			КонецЕсли;	
			
			НайденыеСекции = СтрокаФайлаОтчета.Секции.НайтиСтроки(СтруктураПоиска);
			Если ЗначениеЗаполнено(НайденыеСекции) Тогда 
				СтрокаСекции = НайденыеСекции[0];
				
			Иначе 
				СтрокаСекции = СтрокаФайлаОтчета.Секции.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСекции,СтруктураПоиска);
				
				СтрокаСекции.Раздел1 = СтруктураДанных.ШаблоныРазделов.Раздел1.СкопироватьКолонки();
				СтрокаСекции.Раздел2 = СтруктураДанных.ШаблоныРазделов.Раздел2.СкопироватьКолонки();
				СтрокаСекции.Раздел3 = СтруктураДанных.ШаблоныРазделов.Раздел3.СкопироватьКолонки();
				СтрокаСекции.Раздел4 = СтруктураДанных.ШаблоныРазделов.Раздел4.СкопироватьКолонки();
				СтрокаСекции.Раздел5 = СтруктураДанных.ШаблоныРазделов.Раздел5.СкопироватьКолонки();
				СтрокаСекции.Раздел6 = СтруктураДанных.ШаблоныРазделов.Раздел6.СкопироватьКолонки();
				СтрокаСекции.Раздел7 = СтруктураДанных.ШаблоныРазделов.Раздел7.СкопироватьКолонки();
				СтрокаСекции.Раздел8 = СтруктураДанных.ШаблоныРазделов.Раздел8.СкопироватьКолонки();
				
			КонецЕсли;
			
			Для Каждого СтрокаДанныхСекции из ДанныеСекции Цикл 
				РазделДанных = СтрокаСекции[СтрокаДанныхСекции.Раздел];
				
				Если СтрокаДанныхСекции.Раздел = "Раздел8" Тогда
					КодСтроки = Формат(СтрокаДанныхСекции.КодСтроки,"ЧЦ=3; ЧВН=; ЧГ=0");
				Иначе	
					КодСтроки = СтрокаДанныхСекции.КодСтроки;
				КонецЕсли;	
				НайденаяСтрока = РазделДанных.Найти(КодСтроки,"КодСтроки");
				
				Если НайденаяСтрока = Неопределено Тогда 
					НайденаяСтрока = РазделДанных.Добавить();
					НайденаяСтрока.КодСтроки = КодСтроки;
				КонецЕсли;
				
				Если СтрокаДанныхСекции.Раздел = "Раздел7" Тогда
					НайденаяСтрока["Графа"+СтрокаДанныхСекции.КодГрафы] = СтрокаДанныхСекции.Значение;
				ИначеЕсли СтрокаДанныхСекции.Раздел = "Раздел8" Тогда
					Если СтрокаДанныхСекции.КодГрафы = "02" ИЛИ СтрокаДанныхСекции.КодГрафы = "04" Тогда
						НайденаяСтрока["Графа"+СтрокаДанныхСекции.КодГрафы] = СтрокаДанныхСекции.ЗначениеСтрока;
					Иначе	
						НайденаяСтрока["Графа"+СтрокаДанныхСекции.КодГрафы] = СтрокаДанныхСекции.Значение;
					КонецЕсли;	
				Иначе
					НайденаяСтрока["Графа"+СтрокаДанныхСекции.КодГрафы] = НайденаяСтрока["Графа"+СтрокаДанныхСекции.КодГрафы] + СтрокаДанныхСекции.Значение;
				КонецЕсли;	
				
			КонецЦикла;	
		КонецЦикла;	
		
	КонецЦикла;	
	
КонецПроцедуры


// Сбор данных
////////////////////////////////////////////////////////////////////////////////
// Сохранение в файлы

Процедура СформироватьВыходныеФайлы(СтруктураДанных)
	
	Если Не ЗначениеЗаполнено(СтруктураДанных.ДанныеОтчетов) Тогда 
		ВызватьИсключение НСтр("ru = 'Нет данных для формирования файлов.'");
	КонецЕсли;
	
	КаталогТекущейГруппы = СтруктураДанных.ВременныйКаталог + Строка(Новый УникальныйИдентификатор) + ПолучитьРазделительПути();
	
	СоздатьКаталог(КаталогТекущейГруппы);
	
	СформироватьФайлыГруппы(КаталогТекущейГруппы,СтруктураДанных);
	
	
	ИмяАрхива = ПолучитьИмяВременногоФайла("ZIP");
	
	Архив = Новый ЗаписьZipФайла(ИмяАрхива); 
	Архив.Добавить(КаталогТекущейГруппы + "*",РежимСохраненияПутейZIP.НеСохранятьПути);
	Архив.Записать();
	
	НоваяСтрока = СтруктураДанных.ДанныеТекущегоПакета.ФайлыОтчетов.Добавить();
	НоваяСтрока.Группа = 0;
	НоваяСтрока.ДанныеФайлов = Новый ДвоичныеДанные(ИмяАрхива);
	
	УдалитьФайлы(ИмяАрхива);
	
КонецПроцедуры

Процедура СформироватьФайлыГруппы(КаталогТекущейГруппы,СтруктураДанных)
	
	// Это несколько отчетов которые нужно собрать в один архив который уже поместить в архив группы.
	ИменаПодгруппОтчетов = Новый Соответствие;
	
	Для Каждого ДанныеОтчета Из СтруктураДанных.ДанныеОтчетов Цикл 
		
		ИмяПодгруппы = СформироватьИмяПодгруппы(ДанныеОтчета,СтруктураДанных);
		
		НайденноеСоответствие = ИменаПодгруппОтчетов.Получить(ИмяПодгруппы);
		Если НайденноеСоответствие = Неопределено Тогда 
			
			ПутьДляФайловПодгруппы = СтруктураДанных.ВременныйКаталог + ИмяПодгруппы + ПолучитьРазделительПути();
			СоздатьКаталог(ПутьДляФайловПодгруппы);
			ИменаПодгруппОтчетов.Вставить(ИмяПодгруппы, ПутьДляФайловПодгруппы);
			
		Иначе 
			
			ПутьДляФайловПодгруппы = НайденноеСоответствие;
			
		КонецЕсли;
		
		ЗаписатьДанныеВФайл(ДанныеОтчета, ПутьДляФайловПодгруппы, СтруктураДанных);
		
	КонецЦикла;	
	
	
	
	Для Каждого СтрокаПодгруппы  Из ИменаПодгруппОтчетов Цикл 
		
		ПутьАрхива = КаталогТекущейГруппы + СтрокаПодгруппы.Ключ + ".ZIP";
		
		Архив = Новый ЗаписьZipФайла(ПутьАрхива); 
		Архив.Добавить(СтрокаПодгруппы.Значение + "*.*");
		Архив.Записать();
		
		УдалитьФайлы(СтрокаПодгруппы.Значение);
		
	КонецЦикла;
	
	
КонецПроцедуры	

Функция СформироватьИмяПодгруппы(ДанныеОтчета, СтруктураДанных)
	
	Результат = ДанныеОтчета.ВИД 
	+ СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ДанныеОтчета.ИСТ,3)
	+ Формат(ДанныеОтчета.РДТ,"ДФ=ddMMyy")
	+ СтруктураДанных.НомерВерсииТекущегоПакета;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьДанныеВФайл(ДанныеОтчета, КаталогВыгрузки, СтруктураДанных)
	
	
	ИмяФайла = СформироватьИмяФайла(ДанныеОтчета,СтруктураДанных);
	
	ПутьФайла = ПолучитьУникальноеИмяФайла(КаталогВыгрузки + ИмяФайла);
	
	ЗаписьТекста = Новый ЗаписьТекста(ПутьФайла,"windows-1251");
	
	// Запись заголовка
	ЗаписатьЗаголовок(ДанныеОтчета, ЗаписьТекста, СтруктураДанных);
	ЗаписатьСодержание(ДанныеОтчета, ЗаписьТекста, СтруктураДанных);
	ЗаписатьПодвал(ДанныеОтчета, ЗаписьТекста, СтруктураДанных);
	
	ЗаписьТекста.Закрыть();
	
КонецПроцедуры

Процедура ЗаписатьЗаголовок(ДанныеОтчета, ЗаписьТекста, СтруктураДанных)
	
	// Формирование заголовка
	ЗаписьТекста.ЗаписатьСтроку("#%");
	
	ЗаписьТекста.ЗаписатьСтроку("КОДФ=" + ДанныеОтчета.КОДФ);
	ЗаписьТекста.ЗаписатьСтроку("РДТ="  + Формат(ДанныеОтчета.РДТ,"ДФ=dd.MM.yyyy"));
	ЗаписьТекста.ЗаписатьСтроку("ВИД="  + ДанныеОтчета.ВИД);
	ЗаписьТекста.ЗаписатьСтроку("ИСТ="  + СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ДанныеОтчета.ИСТ,3));
	Если ДанныеОтчета.ВИД = "3" или ДанныеОтчета.ВИД = "5" Тогда 
		ЗаписьТекста.ЗаписатьСтроку("УТВЧ=" + Формат(ДанныеОтчета.УТВЧ,"ЧДЦ=0; ЧН=0; ЧГ=0"));
	КонецЕсли;

	
КонецПроцедуры

Процедура ЗаписатьСодержание(ДанныеОтчета, ЗаписьТекста, СтруктураДанных)
	
	СекцииВыведены = Ложь;
	Для Каждого ДанныеСекции Из ДанныеОтчета.Секции Цикл
		
		Если СекцииВыведены Тогда
			ЗаписьТекста.ЗаписатьСтроку("#%");
		КонецЕсли;
		
		ЗаписьТекста.ЗаписатьСтроку("РЗПР=" + ДанныеСекции.РЗПР);
		ЗаписьТекста.ЗаписатьСтроку("ЦСТ="  + ДанныеСекции.ЦСТ);
		ЗаписьТекста.ЗаписатьСтроку("ВР="   + ДанныеСекции.ВР);
		ЗаписьТекста.ЗаписатьСтроку("КСТР=" + ДанныеСекции.КСТР);
		
		Если ДанныеОтчета.ВИД = "5" Тогда
			ЗаписьТекста.ЗаписатьСтроку("РЕГ=" + ДанныеСекции.РЕГ);
		КонецЕсли;
		
		ЗаписьТекста.ЗаписатьСтроку("#");
		СекцииВыведены = Истина;
		
		// Вывод секций.
		Для Сч = 1 По 8 Цикл
			
			ДанныеРаздела = ДанныеСекции["Раздел"+Сч];
			Если ЗначениеЗаполнено(ДанныеРаздела) Тогда
				ЗаписьТекста.ЗаписатьСтроку("#@");
				
				//Нумерация разделов в 14 и 14МО отличаются. Для формы МО нужно применить сдвиг номеров разделов:
				Если ДанныеОтчета.КОДФ = "014mo" И Сч = 5 Тогда
					ЗаписьТекста.ЗаписатьСтроку("ТБ=04");
				ИначеЕсли ДанныеОтчета.КОДФ = "014mo" И Сч = 6 Тогда
					ЗаписьТекста.ЗаписатьСтроку("ТБ=05");
				Иначе
					ЗаписьТекста.ЗаписатьСтроку("ТБ=0"+Сч);
				КонецЕсли;
				
				ЗаписьТекста.ЗаписатьСтроку("#$");
				
				Для Каждого СтрокаТаблицы Из ДанныеРаздела Цикл
					
					СтрокаВывода = "";
					Для Каждого Колонка Из ДанныеРаздела.Колонки Цикл
						Значение = СтрокаТаблицы[Колонка.Имя];
						Если Колонка.Имя <> "КодСтроки" Тогда
							Значение = Формат(Значение,"ЧДЦ=0; ЧН=0; ЧГ=0");
						КонецЕсли;
						СтрокаВывода = СтрокаВывода + "|" + Значение;
					КонецЦикла;
					
					ЗаписьТекста.ЗаписатьСтроку(Сред(СтрокаВывода,2)+"|");
					
				КонецЦикла;
				
				ЗаписьТекста.ЗаписатьСтроку("#");
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьПодвал(ДанныеОтчета, ЗаписьТекста, СтруктураДанных)
	
	// Заключительная часть.
	ЗаписьТекста.ЗаписатьСтроку("#&");
	
	Руководитель = БюджетнаяОтчетностьПолучениеНСИ.ОтветственноеЛицоОрганизации(ДанныеОтчета.Организация,"Руководитель");
	ГлБухгалтер  = БюджетнаяОтчетностьПолучениеНСИ.ОтветственноеЛицоОрганизации(ДанныеОтчета.Организация,"ГлавныйБухгалтер");
	
	ЗаписьТекста.ЗаписатьСтроку("Руководитель="+БюджетнаяОтчетностьКлиентСервер.ПолучитьФамилиюИмяОтчество(Строка(Руководитель)));
	ЗаписьТекста.ЗаписатьСтроку("Главный бухгалтер="+БюджетнаяОтчетностьКлиентСервер.ПолучитьФамилиюИмяОтчество(Строка(ГлБухгалтер)));
	ЗаписьТекста.ЗаписатьСтроку("Тел.="+ДанныеОтчета.Телефон);
			
	ЗаписьТекста.ЗаписатьСтроку("#");
	ЗаписьТекста.ЗаписатьСтроку("#*");
	ЗаписьТекста.ЗаписатьСтроку("ППО=" + Метаданные.Синоним);
	ЗаписьТекста.ЗаписатьСтроку("#");
	ЗаписьТекста.ЗаписатьСтроку("##");
	
КонецПроцедуры

Функция СформироватьИмяФайла(ДанныеОтчета, СтруктураДанных)
	
	Результат = ДанныеОтчета.КОДФ 
	+ ПолучитьКодПериодичности(ДанныеОтчета.ПериодОтчета.Периодичность, "ДляИмениФайла", СтруктураДанных) 
	+ СтруктураДанных.НомерВерсииТекущегоПакета 
	+ ".txt";
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКодПериодичности(Периодичность, ТипКода, СтруктураДанных)
	
	ИмяПериодичности = ПолучитьПолноеИмяПредопределенногоЗначения(Периодичность);
	
	Результат = Новый Структура("ДляЗаголовка,ДляИмениФайла");
	
	Если ИмяПериодичности = БюджетнаяОтчетностьКлиентСерверПовтИсп.ПолучитьПеречислениеПериодичность("Год") Тогда
		Результат.ДляЗаголовка = "";
		Результат.ДляИмениФайла = "Y";
		
	ИначеЕсли ИмяПериодичности = БюджетнаяОтчетностьКлиентСерверПовтИсп.ПолучитьПеречислениеПериодичность("ДевятьМесяцев") Тогда
		Результат.ДляЗаголовка = "";
		Результат.ДляИмениФайла = "N";
		
	ИначеЕсли ИмяПериодичности = БюджетнаяОтчетностьКлиентСерверПовтИсп.ПолучитьПеречислениеПериодичность("Полугодие") Тогда
		Результат.ДляЗаголовка = "";
		Результат.ДляИмениФайла = "Q";
		
	ИначеЕсли ИмяПериодичности = БюджетнаяОтчетностьКлиентСерверПовтИсп.ПолучитьПеречислениеПериодичность("Квартал") Тогда
		Результат.ДляЗаголовка = "";
		Результат.ДляИмениФайла = "Q";//не предусмотрено
		
		ИначеЕсли ИмяПериодичности = БюджетнаяОтчетностьКлиентСерверПовтИсп.ПолучитьПеречислениеПериодичность("Месяц") Тогда
		Результат.ДляЗаголовка = "";
		Результат.ДляИмениФайла = "Q";//не предусмотрено
		
	ИначеЕсли ИмяПериодичности = БюджетнаяОтчетностьКлиентСерверПовтИсп.ПолучитьПеречислениеПериодичность("Декада") Тогда
		Результат.ДляЗаголовка = "";
		Результат.ДляИмениФайла = "Q";//не предусмотрено
		
	ИначеЕсли ИмяПериодичности = БюджетнаяОтчетностьКлиентСерверПовтИсп.ПолучитьПеречислениеПериодичность("День") Тогда
		Результат.ДляЗаголовка = "";
		Результат.ДляИмениФайла = "Q";//не предусмотрено
		
	Иначе  
		Результат.ДляЗаголовка = "";
		Результат.ДляИмениФайла = "Q";
		
	КонецЕсли;
	
	
	Возврат Результат[ТипКода];
КонецФункции

Функция ПолучитьУникальноеИмяФайла(ИсходноеИмя)
	
	ШаблонИмениФайла = ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиентСервер.ПолучитьШаблонУникальногоИмениФайла(ИсходноеИмя);
	Результат = ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиентСервер.ПолучитьУникальноеИмяФайла(ШаблонИмениФайла); 
	
	Если ИсходноеИмя <> Результат Тогда 	
		Шаблон = НСтр("ru = 'Файл с именем ""%1"" уже был выгружен. Новый файл будет иметь имя ""%2"".'");
		Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, ИсходноеИмя, Результат);
		
		Сообщить(Сообщение,СтатусСообщения.Внимание);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Сохранение в файлы
// формирование файлов отчетов 
////////////////////////////////////////////////////////////////////////////////

#КонецЕсли
